<template>
  <!-- 用户协议 -->
  <div class="wrapped-text">
    <p>急性心梗患者院内不良事件链早期预警智能平台研究项目用户协议</p>
    <p>您好！本研究是上海交通大学医学院附属仁济医院发起的急性心梗患者院内不良事件链早期预警智能平台研究项目，本研究借助HUAWEI Research创新研究平台和HUAWEI WATCH GT2 PRO智能穿戴设备高精度传感器技术，用于急性心梗患者院内不良时间链早期预警可行性研究。在您同意参加之前，请您知悉以下信息。</p>
    <p>一 急性心梗患者院内不良事件链早期预警智能平台研究项目介绍</p>
    <p>XXX（填写研究项目的背景、价值）</p>
    <p>本研究是基于华为智能穿戴设备开展的持续三（填写项目持续年数）年的急性心梗患者院内不良事件链早期预警研究，拟通过华为穿戴设备的心率、血氧浓度、呼吸等运动健康数据， 用于用于急性心梗患者院内不良时间链早期预警可行性研究。</p>
    <p>以下条款是您与上海交通大学医学院附属仁济医院订立的具备法律效力的协议。本协议确立您参加急性心梗患者院内不良事件链早期预警智能平台研究项目（以下统称“本服务”）时享有的法律责任和权利。 在本协议中，“您”指任何使用和访问本服务的个人。</p>
    <p>二 使用本服务的要求</p>
    <p>您明确声明和保证：您具备足够的法律权利或授权来签署和履行本协议;您对于本协议的签署和履行不会对您须履行的任何其他协议、安排造成冲突或导致违约。</p>
    <p>1.年龄要求</p>
    <p>本服务不对未成年人（即不满18周岁）提供相关服务，请确认您已成年且具有完全的民事行为能力。同时，我们建议家长或监护人对您的孩子使用互联网、手机和其他设备的行为进行监管和指导。</p>
    <p>2.设备要求</p>
    <p>使用本服务要求您具备huawei watch gt2pro ecg，无线移动数据服务，相关软件以及适用的网络服务提供商提供的互联网连接（使用互联网服务时需要宽带连接）等。</p>
    <p>3.其他要求</p>
    <p>使用本服务要求您能够正常阅读中文及使用中文对话。</p>
    <p>三、可能存在的风险</p>
    <p>参与本服务过程中需要连续佩戴3（填写项目持续年数）年智能穿戴设备，这可能会给您的生活带来一定的不便。若佩戴不适，请记录不适情况， 必要时请通过chengang@zhltdtm.com与我们联系并终止研究。</p>
    <p>四、相关受益</p>
    <p>1. 您将获得智能手环在研究期间的使用权。</p>
    <p>2. 若您按要求参与整个研究过程，为感谢支持，您将得到一套智能手环和与您书面约定的奖励金;若您中途退出研究，您需将手环交回，但您仍然能获得与您书面约定的奖励金， 奖励金金额与您参与研究的时间长度和数据情况相关，具体参照线下签署的知情同意书。</p>
    <p>（注意：根据项目实际情况酌情进行增删改）</p>
    <p>五 急性心梗患者院内不良事件链早期预警智能平台APP应用介绍</p>
    <p>急性心梗患者院内不良事件链早期预警智能平台APP应用是本服务用于急性心梗患者院内不良事件链早期预警智能平台研究，上海交通大学医学院附属仁济医院为急性心梗患者院内不良事件链早期预警智能平台APP开发和运营的责任主体，此APP的主要功能如下：</p>
    <p>1.账号登录和个人信息管理</p>
    <p>为了管理您的个人信息和智能穿戴设备采集的数据，需要您注册并登录急性心梗患者院内不良事件链早期预警智能平台APP应用账号。</p>
    <p>2.穿戴设备管理</p>
    <p>本服务支持管理您的手环、手表等设备。通过蓝牙、配对连接穿戴设备、管理设备的使用，并从设备上获取您的运动健康数据。</p>
    <p>3.测试数据记录</p>
    <p>本服务支持手机对智能穿戴设备采集的数据进行记录、保存与上传至云服务器。</p>
    <p>（根据APP的功能进行增删改）</p>
    <p>六、本服务可用性</p>
    <p>本研究团队来自上海交通大学医学院附属仁济医院，我们将志愿者的个人意愿放在首位，但我们或本团队无法保证所有或任一部分的服务在任何时间内皆可用、 正常运行、或无缺陷。由于某些国家和地区没有提供本服务所必需的环境和条件，本服务在这些国家和地区将可能无法正常使用。因此种情况造成的无法提供服务不应视为上海交通大学医学院附属仁济医院（填写研究机构的营业执照载明名称）违约。</p>
    <p>此外，本团队无法承诺您通过使用本服务而存储或获取的信息不会损坏、遗失、不可用或被删除。您理解并同意您有义务备份您的全部和任一信息。 您同时也理解并同意，如您使用不同的终端设备来使用本服务，您上传或下载的信息可能将不可用。</p>
    <p>七 您的行为</p>
    <p>您同意合理地使用本服务，并接受本协议和遵守任何有效的法律法规。</p>
    <p>您同意不会利用本服务实施下列任一行为：</p>
    <p>1.上传、下载、存储、传输、以电子邮件发送或以其他方式提供任何非法、威胁、有害、诽谤、侮辱、暴力、淫秽、种族或民族歧视性质或在其他方面令人反感的内容;</p>
    <p>2.侵害他人隐私权、商业秘密、商标权、著作权、专利权及其他权利;</p>
    <p>3.从事任何不法交易行为，如贩卖枪支、毒品、禁药或其他违禁物;</p>
    <p>4.计划实施或实施洗钱、套现等非法活动;</p>
    <p>5.使用无效银行账户或他人银行账户进行交易;</p>
    <p>6.其他违反国家法律、法规、规章及政策法令的行为，或其他违反本协议的行为。</p>
    <p>八、用户内容</p>
    <p>“用户内容”系指用户通过使用本服务形成的信息、内容和材料，如图形、文字、图像、声音、视频、软件和数据文件等。您须单独对任何您或以您帐户的名义进行的上传、 下载、发布、通过电子邮件发送、传输、存储的用户内容承担完全责任。您同意因使用其他本服务用户的用户内容而产生的风险， 完全由您自行承担风险，XXX（填写研究机构的营业执照载明名称） 不为任何您认为庸俗的、令人反感的、不雅或不适当的用户内容承担任何责任。</p>
    <p>九、授权</p>
    <p>上海交通大学医学院附属仁济医院特此授予您不可撤销的、非排他性的、不可转让的许可（以下简称“许可”）以依据本协议来使用本服务，并承诺：</p>
    <p>1.不得复制任何作为本服务的一部分的内容，除非这种复制是根据本协议所授权的;</p>
    <p>2.不得出租、租赁、分许可、抵押、翻译、与任何其他产品或服务合并、调整、更改或修改本服务;</p>
    <p>3.不得对本服务的全部或任何部分进行分解、反编译、反向工程或创建任何衍生作品，也不尝试做任何这样的事情;</p>
    <p>4.未经上海交通大学医学院附属仁济医院书面同意的情况下，不得以任何方式向任何第三方提供，或让第三方使用全部或部分的服务 （包括但不限于用户内容、程序清单、对象和源程序清单、目标代码和源代码）;</p>
    <p>5.不得以欺诈方式或出于任何欺诈的目的使用本服务;</p>
    <p>6.不得删除本服务中出现的任何所有权声明或标签;</p>
    <p>7.不尝试禁用、绕过、修改、使失效、或以其他方式规避与本服务有关的或作为本服务的组成部分的任何数字版权管理系统。</p>
    <p>尽管本研究团队努力为您提供个性化服务，但您理解本服务不是为了也无法满足您所有的个人特殊需求。上海交通大学医学院附属仁济医院无法确保在任何文件中描述的本服务及其功能满足您的个人特殊需求。</p>
    <p>您理解并同意，在本许可及条款有效期间内，上海交通大学医学院附属仁济医院可能以转移、分包、或其他方式处置本许可和条款约定的义务， 以及因本许可和条款所产生的权利义务。</p>
    <p>十、其他条款</p>
    <p>本研究团队可能不定期更新或修改本协议，并通过在本服务中发布公告等方式发送修改内容，您理解并认可，只有在获取您的同意后， 我们才会按照更新后的声明收集、使用、存储您的个人信息。此外，您的终端设备的用户手册也可能不时进行修订。您理解，当您从第三方获取服务时， 您可能会要求接受第三方的协议条款，包括但不限于您的通信运营商的协议条款。</p>
    <p>十一、侵权通知和程序</p>
    <p>您应尊重上海交通大学医学院附属仁济医院和任何第三方的知识产权。上海交通大学医学院附属仁济医院可能会删除或禁止访问任何涉嫌侵犯知识产权或者其他权利的内容， 并有权以侵犯上海交通大学医学院附属仁济医院或第三方的知识产权的理由关停任何帐户或禁止其使用本服务。如果你知道任何此类侵权行为，请与我们联系：chengang@zhltdtm.com。</p>
    <p>十二、声明</p>
    <p>上海交通大学医学院附属仁济医院将通过本服务，或发送邮件至任何您向本研究团队提供的有效电子邮件地址或邮寄地址，给您相关法律所规定的所有通知。 您承诺保持您向本研究团队提供的电子邮件地址和邮寄地址的有效性，并且您不定时检查这些邮件。</p>
    <p>除非另有说明，上海交通大学医学院附属仁济医院不对本服务提供专门的客户支持。</p>
    <p>十三、免责</p>
    <p>上海交通大学医学院附属仁济医院和其合作伙伴不提供任何明示或暗示的陈述或保证，包括但不限于适销性，可商用性，针对特定用途或不侵犯任何权利。上海交通大学医学院附属仁济医院及其合作伙伴特别对以下情形不作任何保证：（一）本服务将满足您的特定需求;（二）本服务将在不间断、及时、安全或没有缺陷的 情况下提供;（三）您使用本服务过程中获取的任何信息是准确或可靠或（四）作为本服务的一部分的任何软件的任何缺陷或错误都将得到更正。上海交通大学医学院附属仁济医院无法控制您的网络运营商，因此对于其网络覆盖范围、可用性或提供的服务质量无法提供任何保证。您需自行承担通过本服务下载、获得、访问的所有内容和其他材料的风险， 以及您使用本服务或第三方服务而导致的设备和数据损害、内容丢失的风险。使用本服务的同时，您应当遵守所有相关的有效法律。您可能拥有其他合法的消费者权利， 这些权利不因本协议而受到影响。如果当地生效的法律法规认定排除某些法定条款为无效的，但上海交通大学医学院附属仁济医院违反此类法律的责任将会被限制到法律允许的最小程度。</p>
    <p>某些司法辖区禁止排除特定保证或限制，或者排除特定损害的赔偿责任。因此，某些免责声明和责任限制可能不适用于您。您明确理解并同意，上海交通大学医学院附属仁济医院及其附属公司、子公司、管理人员、员工、代理商、合作伙伴和授权方，在下述情况里，对您的任何直接、间接、附带、特别、衍生性或惩罚性的损害，不承担任何责任，包括但不限于利润损失、商誉损失、 以及其他无形损失（即使上海交通大学医学院附属仁济医院已被告知此类损害的可能性）：（一）使用或无法使用本服务（二）对本服务的变更、任何临时或永久性的对全部或部分服务的停止; （三）未经授权的访问或更改您的传输或数据;（四）删除、毁坏或未能存储和/或发送或接收您通过本服务的传输或数据;（五）服务中任何第三方的声明或行为;（六）任何其他与本服务有关的事宜。</p>
    <p>十四、赔偿</p>
    <p>在以下情形下，您有义务应对、保障上海交通大学医学院附属仁济医院及其职员、雇员、代理商、合作伙伴、供应商和许可方免受任何第三方的索赔或诉讼请求， 包括合理的律师费：（一）在使用本服务过程中，以您账号的名义提交、发布、传送或以其他方式造成用户内容可用而导致的;（二）以您账号的名义使用本服务和参加的活动而导致的; （三）您违反本协议的任何行为而导致的;（四）您侵犯任何第三方的权利的行为，例如侵害任何第三方的知识产权，或发布对他人的诽谤性内容，或发布违反任何保密协议的内容而导致的; 或（五）未经授权擅自修改或更改任何本服务内容而导致的。上述义务在您终止使用本服务或本协议终止的情况下依然生效。</p>
    <p>十五、适用法律和管辖</p>
    <p>本协议的订立、管辖和解释均依据中华人民共和国法律，而不考虑其冲突规范。双方约定，本协议签订地为XXX省XXX市XXX区（填写具体的省、市、区）。您和XXX（填写研究机构的营业执照载明名称）同意， 因履行本协议，接受本协议下的本服务所产生的任何纠纷、索赔和主张，均应当提交XXX省XXX市XXX区（填写具体的省、市、区）有管辖权的法院诉讼解决。</p>
    <p>十六、一般条款</p>
    <p>若本条的部分内容被法院或其他有权机关判定为无效的，其他条款内容不受影响，并在法律允许的最大限度内对双方继续产生约束力及可执行力。</p>
    <p>本协议的标题仅为方便而使用，不具备法律和协议的效力。</p>
    <p>您知悉并同意，上海交通大学医学院附属仁济医院可以不经事先通知，在任何时候分发本协议所有或部分义务。您不得分发本协议下的义务或分发、 转让或转授权本服务下的权利。</p>
    <p>您同意，如果上海交通大学医学院附属仁济医院不要求实现或强制执行在本协议下的任何法律权利或补救措施，这并不表示上海交通大学医学院附属仁济医院放弃这些权利或补救措施，上海交通大学医学院附属仁济医院仍保留其行使权利。这些条款（包括隐私权政策，用户手册和依法成立的任何其他条款）构成您和上海交通大学医学院附属仁济医院之间就使用本服务的全部协议。</p>
    <p>本协议的译本仅供参考。若其他语言译本的条款与中文版本的条款相冲突，以中文版本为准。</p>
    <p>十七、终止</p>
    <p>您有权自愿决定是否接受本服务，有权在研究任何阶段退出。</p>
    <p>您可以通过停止使用本服务或通过您的帐户设置来终止您的帐户。上海交通大学医学院附属仁济医院可能会依法律、诉讼、司法机关或政府机关的要求终止您的账户。</p>
    <p>您的帐户终止后，上海交通大学医学院附属仁济医院不会再获取您帐户下的资料。</p>
    <p>您的帐户终止后，上海交通大学医学院附属仁济医院和任何第三方对于您帐户终止后造成的无法获得本服务的后果不承担任何责任。</p>
    <p>您的帐户终止后，上海交通大学医学院附属仁济医院将会在本次研究项目实施时间截止日（XXX（填写具体的研究项目截止时间）） 之前删除或匿名化任何及所有您帐户下的资料，文件和存储的内容，但您发送给其他用户的内容，包括消息，也可能无法删除。</p>
    <p>十八、不可抗力</p>
    <p>XXX（填写研究机构的营业执照载明名称）及其雇员、代理人或分包商对不可抗力事件的事件所造成的无法履行义务、 或延迟履行义务以及履行其他本协议下的任何义务的后果不承担任何责任。</p>
    <p>十九、权利放弃</p>
    <p>本协议履行期间，如果上海交通大学医学院附属仁济医院未行使任何权利或补救措施，这不表示上海交通大学医学院附属仁济医院放弃这些权利或补救措施，您并不得免除遵守这种义务。上海交通大学医学院附属仁济医院任何默认的放弃不构成任何后续违约的豁免。 除非上海交通大学医学院附属仁济医院明确表示放弃权利并书面通知您，则上海交通大学医学院附属仁济医院对本协议下任何内容的豁免应是无效。</p>
    <p>二十、特别规定</p>
    <p>您明确声明和保证，您不会（且上海交通大学医学院附属仁济医院亦不接受）通过上海交通大学医学院附属仁济医院提供的服务上传、同步、 传输任何受到美国工业和安全局出口管制法规约束的软件，技术数据及其他任何资料。如果您不遵守上述保证，您的行为将被视为美国出口管制法规规制的“出口”行为， 您可能会因此面临处罚。上海交通大学医学院附属仁济医院在法律允许的最大范围内不承担任何责任。</p>
    <p>您明确声明和保证，你不会上传、同步、处理或转移任何可能侵犯任何国家的知识产权的资料。</p>
    <p>最近更新日期：2023年9月26日</p>
    <div class="bottom-space"></div>
  </div>
</template>

<script lang="ts">
import { defineComponent, onMounted, ref } from 'vue';

export default defineComponent({
  setup() {
    // const text = ref('');

    // onMounted(async () => {
    //   try {
    //     const response = await fetch('/src/assets/file/用户协议v1.0.txt');
    //     const data = await response.text();
    //     text.value = data;
    //   } catch (error) {
    //     console.error('获取文本文件内容时出错：', error);
    //   }
    // });

    return {
    };
  },
});
</script>

<style scoped lang="less">
.wrapped-text {
  margin-top: 20rpx;
  word-wrap: break-word;
  word-break: break-all;
  white-space: pre-wrap;
  padding: 0 60rpx;
  font-size: 30rpx;
  font-weight: 400;
  height: 100%;
  overflow-y: scroll;
  p{
  margin-top: 20rpx;
  margin-bottom: 20rpx;
  }
  .bottom-space {
    height: 40rpx; 
  }
}
</style>